[
	{
		"title": {
			"en": "Chalmers",
			"sv": "Chalmers"
		},
		"when": {
			"en": "August 2019 - Juni 2024",
			"sv": "Augusti 2019 - Juni 2024"
		},
		"what": {
			"en": "BSc and MSc in Software Engineering",
			"sv": "Civilingenjörsexamen inom IT"
		},
		"description": {
			"en": "A comprehensive education that has provided me with a foundation from which I feel confident to tackle any challenge. I have learned everything from basic principles of software development and mathematics to designing interfaces and building web applications. Beyond technical knowledge, I have also acquired the skills to communicate effectively as an engineer, lead and work in teams, understand the psychology that affects developers, and much more.",
			"sv": "Bred utbildning som gett mig en bas från vilken jag känner mig trygg att ta mig an vilken utmaning som helst. Jag har lärt mig allt från grundläggande principer inom mjukvaruutveckling och matematik, till att utforma gränssnitt och bygga webbapplikationer. Utöver de tekniska kunskaperna har jag även lärt mig att effektivt kommunicera som ingenjör, leda och arbeta i team, psykologi som påverkar utvecklare, och mycket mer."
		},
		"grade": "4.68",
		"courses": []
	},
	{
		"title": {
			"en": "Z-order Curve-based Traffic Event Detection Using Deep Learning",
			"sv": "Z-order Curve-based Traffic Event Detection Using Deep Learning"
		},
		"when": {
			"en": "Spring 2024 (in progress)",
			"sv": "Våren 2024 (pågående)"
		},
		"what": {
			"en": "Master’s Thesis",
			"sv": "Examensarbete"
		},
		"description": {
			"en": "Explored a novel approach leveraging machine learning and space-filling curves for computationally efficient traffic event retrieval in large-scale, unlabelled video datasets. The thesis contributed to the research of driver assistance systems by providing a proof of concept for how companies can get value from their collected automotive data. In collaboration with Volvo Cars. Conducted with one other student.",
			"sv": "Utforskade en ny metod som använder maskininlärning och 'space-filling curves' för att hitta trafikhändelser från storskaliga databaser med icke-annoterad videodata. Arbetet bidrog till forskning för utvecklingen av förarsystem genom att hjälpa företag få värde från sin insamlade trafikdata. I samarbete med Volvo Personvagnar AB. Gjort med en annan student."
		},
		"skills": [
			{
				"text": "Python",
				"category": "programming"
			},
			{
				"text": "Space-filling Curves",
				"category": "programming"
			},
			{
				"text": "Saliency Prediction",
				"category": "AI"
			}
		]
	},
	{
		"title": {
			"en": "Hospital Visualization and Prediction",
			"sv": "Den Intelligenta Akutmottagningen"
		},
		"when": {
			"en": "Spring 2022",
			"sv": "Våren 2022"
		},
		"what": {
			"en": "Bachelor’s Thesis",
			"sv": "Kandidatarbete"
		},
		"description": {
			"en": "Created a tool for hospitial visualization and overview. My main focus was the development of a neural network designed to predict patient flow based on historical data. On behalf of Norra Älvsborgs Länssjukhus. Collaboration with 5 other students.",
			"sv": "Skapade ett verktyg för visualisering och översikt av sjukhus. Min huvudfokus var skapandet av ett neuralt nätverk för att förutsäga patientflöde baserat på historisk data. På uppdrag av Norra Älvsborgs Länssjukhus. Gjort med 5 andra studenter."
		},
		"skills": [
			{
				"text": "Python",
				"category": "programming"
			},
			{
				"text": "AI/ML",
				"category": "AI"
			},
			{
				"text": "Neural Network",
				"category": "AI"
			},
			{
				"text": "TensorFlow Keras",
				"category": "AI"
			}
		]
	},
	{
		"title": {
			"en": "weave",
			"sv": "weave"
		},
		"when": {
			"en": "Fall 2023",
			"sv": "Hösten 2023"
		},
		"what": {
			"en": "Game Development Project",
			"sv": "Spelutvecklingsprojekt"
		},
		"link": "https://www.idxpo.se/current/group_02/build/index.html",
		"description": {
			"en": "Ideated and developed a collaborative game for a game development project course. Players control a line and have to stay alive as long as possible by avoiding each other and obstacles. I contributed to several areas of the development but my main focus was on the UI and interaction design. Collaboration with 5 other students.",
			"sv": "Utvecklade ett spel fokuserat kring samarbete för en kurs i spelutveckling. Spelare styr linjer och måste överleva så länge som möjligt genom att undvika varandra och hinder. Jag bidrog till flera områden av utvecklingen, men mitt huvudsakliga fokus var på UI och interaktionsdesign. Gjort med 5 andra studenter."
		},
		"skills": [
			{
				"text": "Godot",
				"category": "programming"
			},
			{
				"text": "C#",
				"category": "programming"
			},
			{
				"text": "Figma",
				"category": "tools"
			}
		]
	}
]
